#The dataset in this notebook has been taken with the help of a udemy course 
#"Data Analysis Bootcampâ„¢ 21 Real World Case Studies"

In [ ]:
import pandas as pd

In [ ]:
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"

In [ ]:
df=pd.read_csv(file_name,encoding = "ISO-8859-1")
#encoding is being used as there are a few words in Portugese in dataset which will raise an error,to avoid it while reading the dataset we are using encoding.

In [ ]:
df.head()

    ano      mes estado   numero  encontro
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

In [ ]:
column_names={'ano':'year','mes':'month','estado':'state','numero': 'number_of_fires','encontro':'date'}

In [ ]:
df.rename(columns=column_names,inplace=True)
#inplace=True is used to save the changes to the dataframe
#here we are using rename function to rename the columns from Portugese to English.

In [ ]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [ ]:
df.tail()

      year     month      state number_of_fires      date
6449  2012  Dezembro  Tocantins             128  1/1/2012
6450  2013  Dezembro  Tocantins              85  1/1/2013
6451  2014  Dezembro  Tocantins             223  1/1/2014
6452  2015  Dezembro  Tocantins             373  1/1/2015
6453  2016  Dezembro  Tocantins             119  1/1/2016

In [ ]:
df['number_of_fires'] 
#this column has mixed data we want it only to be numeric value without string so we are going to do that in next cell with str.strip() function.

0       0 Fires
1       0 Fires
2       0 Fires
3       0 Fires
4       0 Fires
         ...
6449        128
6450         85
6451        223
6452        373
6453        119
Name: number_of_fires, Length: 6454, dtype: object

In [ ]:
df['number_of_fires']=df['number_of_fires'].str.strip('Fires')

In [ ]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre              0   1/1/1998
1  1999  Janeiro  Acre              0   1/1/1999
2  2000  Janeiro  Acre              0   1/1/2000
3  2001  Janeiro  Acre              0   1/1/2001
4  2002  Janeiro  Acre              0   1/1/2002

In [ ]:
df.isnull().sum()
#using the above piece of code to see if there are any null value in each column

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

In [ ]:
df=df.dropna()
#removed all the rows with empty values under number of fires.

In [ ]:
df.notnull().sum()
#now there are no empty values.

year               6322
month              6322
state              6322
number_of_fires    6322
date               6322
dtype: int64

In [ ]:
df['month'].unique()

array(['Janeiro', 'Fevereiro', 'MarÃ§o', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

In [ ]:
month_names={'Janeiro':'January', 'Fevereiro':'Februrary', 'MarÃ§o':'March', 'Abril':'April', 'Maio':'May', 'Junho':'June', 'Julho':'July',
       'Agosto':'August', 'Setembro':'September', 'Outubro':'October', 'Novembro':'November', 'Dezembro':'December'}

In [ ]:
df['month']=df['month'].map(month_names)
#changing names of monhs from Portugese to English using map function

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df.head()

   year    month state number_of_fires      date
0  1998  January  Acre              0   1/1/1998
1  1999  January  Acre              0   1/1/1999
2  2000  January  Acre              0   1/1/2000
3  2001  January  Acre              0   1/1/2001
4  2002  January  Acre              0   1/1/2002

In [ ]:
df.tail()

      year     month      state number_of_fires      date
6449  2012  December  Tocantins             128  1/1/2012
6450  2013  December  Tocantins              85  1/1/2013
6451  2014  December  Tocantins             223  1/1/2014
6452  2015  December  Tocantins             373  1/1/2015
6453  2016  December  Tocantins             119  1/1/2016

In [ ]:
df.info()
#to check datatypes

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6322 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6322 non-null   int64
 1   month            6322 non-null   object
 2   state            6322 non-null   object
 3   number_of_fires  6322 non-null   object
 4   date             6322 non-null   object
dtypes: int64(1), object(4)
memory usage: 296.3+ KB

In [ ]:
df.dtypes

year                int64
month              object
state              object
number_of_fires    object
date               object
dtype: object

In [ ]:
df['number_of_fires']=df['number_of_fires'].astype('float')
#changed the datatype of number_of_fires from object or string type to numeric.

In [ ]:
df.head()

   year    month state  number_of_fires      date
0  1998  January  Acre              0.0  1/1/1998
1  1999  January  Acre              0.0  1/1/1999
2  2000  January  Acre              0.0  1/1/2000
3  2001  January  Acre              0.0  1/1/2001
4  2002  January  Acre              0.0  1/1/2002

In [ ]:
df['state'].unique()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'parÃ¡', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [ ]:
df['state']=df['state'].str.title()

In [ ]:
df['state'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'ParÃ¡', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'Rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [ ]:
df['state'].str.isnumeric().sum()
#to check if a column of string data type has any numeric values using str.isnumeric() function.

0

In [ ]:
df=df.reset_index()

In [ ]:
df

      index  year     month      state  number_of_fires      date
0         0  1998   January       Acre              0.0  1/1/1998
1         1  1999   January       Acre              0.0  1/1/1999
2         2  2000   January       Acre              0.0  1/1/2000
3         3  2001   January       Acre              0.0  1/1/2001
4         4  2002   January       Acre              0.0  1/1/2002
...     ...   ...       ...        ...              ...       ...
6317   6449  2012  December  Tocantins            128.0  1/1/2012
6318   6450  2013  December  Tocantins             85.0  1/1/2013
6319   6451  2014  December  Tocantins            223.0  1/1/2014
6320   6452  2015  December  Tocantins            373.0  1/1/2015
6321   6453  2016  December  Tocantins            119.0  1/1/2016

[6322 rows x 6 columns]

In [ ]:
#the dataset is now clean